{
    "education": [
        {
            "course": "B.Tech (Computer Science & Engineering - Specialization Cloud Computing & Virtualization Technology), CGPA - 7.85",
            "institution": "University of Petroleum & Energy Studies",
            "location": "Dehradun, India",
            "start_date": "August 2017",
            "end_date": "July 2021"
        }
    ],
    "experience": [
        {
            "title": "Associate",
            "company": "Cognizant Technology Solutions",
            "location": "Gurugram, India",
            "start_date": "July 2021",
            "end_date": "April 2024",
            "description": [
                "Architected and developed enterprise-grade RESTful web services using Java 8, Spring Boot, and MongoDB, serving 500+ concurrent users in a high-volume insurance domain application with 99.5% uptime.",
                "Accelerated document processing workflows by implementing database optimization strategies including compound indexing, query performance tuning, and MongoDB aggregation pipeline optimization, resulting in 50% faster document search capabilities and improved end-user productivity.",
                "Strengthened codebase quality and reliability by conducting thorough debugging sessions, exception handling improvements, and systematic bug resolution across 100+ identified issues, utilizing IDE debugging tools, log analysis, and JUnit testing to ensure robust application performance.",
                "Implemented comprehensive testing strategies using JUnit, Mockito, and integration testing, achieving 85% code coverage through rigorous Test-Driven Development (TDD).",
				"Led cross-functional collaboration with 5+ teams including frontend (React.js), DevOps, MongoDB administrators, and third-party integration teams, utilizing Agile/Scrum methodologies to deliver features 15% ahead of schedule.",
				"Analyzed and modernized legacy codebase through comprehensive code reviews and technical documentation, creating detailed design specifications for 3 major product enhancements that secured client approval and improved system maintainability.",
				"Mentored junior developers through Knowledge Transfer sessions on microservices architecture, Spring Boot best practices, and React.js development, contributing to team skill enhancement and project delivery efficiency."
            ]
        },
        {
            "title": "Trainee",
            "company": "Cognizant Technology Solutions",
            "location": "Remote",
            "start_date": "January 2021",
            "end_date": "July 2021",
            "description": [
                "Completed intensive 5-month Java Full-Stack training program covering Core Java, Spring Framework, Hibernate ORM, RESTful web services, and frontend technologies.",
                "Developed end-to-end pension provisioning portal using React.js, implementing automated workflows that reduced manual processing time by 70% and improved data accuracy."
            ]
        }
    ],
    "skills": [
		{
			"title": "Experience",
			"elements": [
				"~3 y.o.e as a Software Engineer. Experienced in Agile/Scrum methodologies, CI/CD practices, and cloud technologies."
			]
		},
		{
			"title": "Skill Highlight",
			"elements": [
				"Specializing in Java and Spring Boot, developing and deploying RESTful web services."
			]
		},
        {
            "title" : "Programming Languages",
            "elements" : [
                "Java (8, 11, 21)",
                "JavaScript"
            ]
        },
        {
            "title" : "Frameworks and Libraries",
            "elements" : [
                "Spring Boot",
                "Spring Framework (Spring Data, Spring MVC, Spring Security)",
                "React.js",
				"Hibernate"
            ]
        },
        {
            "title" : "Tools",
            "elements" : [
				"Maven",
				"Gradle",
                "Docker", 
				"Apache Kafka",
				"Redis",
				"SonarQube",
				"Git", 
				"Swagger/OpenAPI",
				"Jira", 
				"Slack", 
				"qTest", 
				"Linux", 
				"Intellij IDEA"
            ]
        },
        {
            "title" : "Databases",
            "elements" : [
				"PostgreSQL",
                "MySQL",
                "MongoDB"
            ]
        },
        {
            "title" : "Cloud Technologies",
            "elements" : [
                "AWS (EC2, RDS, S3, Lambda)",
				"Self-Hosting"
            ]
        },
		{
            "title" : "Methodologies & Concepts",
            "elements" : [
                "RESTful APIs",
				"Microservices Architecture",
				"Agile/Scrum",
				"Test-Driven Development (TDD)",
				"Database Optimization",
				"CI/CD (GitLab CI, GitHub Actions)"
            ]
        }
    ],
    "projects": [
        {
            "title": "Beehive",
            "description": "Developed a full-stack social media application (monolithic architecture). Backend: Spring Boot & MySQL for robust user data and content management. Implemented RESTful APIs ensuring efficient frontend-backend communication. Frontend: React.js with Radix & shadcn/ui for an intuitive and engaging user experience.",
            "link": "<a href=\"https://github.com/sadbirby/beehive\" color=\"blue\">(GitHub)</a>"
        },
        {
            "title": "Leaguewatch",
            "description": "Developed a full-stack web application using microservices architecture. Integrated API Gateway, Service Discovery, and Configuration Server for efficient inter-service communication and scalability. Ensured robust code quality and reliability via comprehensive unit/integration tests using JUnit, Mockito (backend), and Jest (frontend).",
            "link": "<a href=\"https://github.com/sadbirby/leaguewatch\" color=\"blue\">(GitHub)</a>"
        }
    ]
}